--------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chadi\OneDrive - Handelshögskolan i Stockholm\MarkupsAndPublicProcurement\Markups-and-Public-Procurement\PublicP
> rocurement\DLW.log
  log type:  text
 opened on:   9 Sep 2024, 01:22:06

. use data, clear

. set more off

. set seed 42

. qui:

. *------FIRST STAGE POLYNOMIAL INTERACTED WITH PROCUREMENT-----------------------*
. local M=3

. local N=3

. forvalues i=1/`M' {
  2.     gen cogs`i'=cogs^(`i')
  3.     gen k`i'=k^(`i')
  4.     forvalues j=1/`N' {
  5.         gen k`i'cogs`j'=k^(`i')*cogs^(`j')
  6.     }
  7. }

. drop k1 cogs1

. xi: reg go c.k*#pp_dummy c.cogs*#pp_dummy year#nace2
note: 1.pp_dummy#c.k3cogs2 omitted because of collinearity.
note: 0b.pp_dummy#c.k3cogs3 omitted because of collinearity.
note: 1.pp_dummy#c.cogs2 omitted because of collinearity.
note: 0b.pp_dummy#c.cogs3 omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     9,620
-------------+----------------------------------   F(76, 9543)     =   1134.65
       Model |  14072.3005        76  185.161849   Prob > F        =    0.0000
    Residual |  1557.30173     9,543  .163187858   R-squared       =    0.9004
-------------+----------------------------------   Adj R-squared   =    0.8996
       Total |  15629.6022     9,619  1.62486768   Root MSE        =    .40397

------------------------------------------------------------------------------------
                go | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
      pp_dummy#c.k |
                0  |   48.93636   10.22938     4.78   0.000      28.8846    68.98813
                1  |   56.64173   10.07138     5.62   0.000     36.89968    76.38377
                   |
pp_dummy#c.k1cogs1 |
                0  |  -9.894242   1.549665    -6.38   0.000    -12.93192   -6.856568
                1  |  -5.182739   1.773249    -2.92   0.003    -8.658684   -1.706793
                   |
pp_dummy#c.k1cogs2 |
                0  |   .4983751   .0885309     5.63   0.000     .3248357    .6719146
                1  |   .0289163   .1107594     0.26   0.794    -.1881956    .2460282
                   |
pp_dummy#c.k1cogs3 |
                0  |   -.004542   .0014441    -3.15   0.002    -.0073727   -.0017113
                1  |    .004687   .0020288     2.31   0.021     .0007101     .008664
                   |
     pp_dummy#c.k2 |
                0  |  -.8619454    .966206    -0.89   0.372    -2.755915    1.032024
                1  |  -3.234055   .7943438    -4.07   0.000    -4.791138   -1.676972
                   |
pp_dummy#c.k2cogs1 |
                0  |   .3443017   .0861125     4.00   0.000     .1755029    .5131005
                1  |   .2583511   .0681583     3.79   0.000     .1247464    .3919559
                   |
pp_dummy#c.k2cogs2 |
                0  |  -.0219909   .0039532    -5.56   0.000      -.02974   -.0142418
                1  |   .0016766   .0065269     0.26   0.797    -.0111175    .0144706
                   |
pp_dummy#c.k2cogs3 |
                0  |   .0002434   .0000909     2.68   0.007     .0000652    .0004217
                1  |   -.000339   .0001536    -2.21   0.027      -.00064   -.0000379
                   |
     pp_dummy#c.k3 |
                0  |  -.0475795    .040085    -1.19   0.235    -.1261547    .0309956
                1  |   .0785412   .0379224     2.07   0.038     .0042052    .1528772
                   |
pp_dummy#c.k3cogs1 |
                0  |   .0021683   .0039716     0.55   0.585    -.0056168    .0099535
                1  |  -.0064325   .0026216    -2.45   0.014    -.0115713   -.0012936
                   |
pp_dummy#c.k3cogs2 |
                0  |   .0000505   .0000975     0.52   0.604    -.0001405    .0002416
                1  |          0  (omitted)
                   |
pp_dummy#c.k3cogs3 |
                0  |          0  (omitted)
                1  |   6.50e-06   1.71e-06     3.81   0.000     3.16e-06    9.85e-06
                   |
   pp_dummy#c.cogs |
                0  |   51.40185   7.547427     6.81   0.000     36.60728    66.19641
                1  |    27.7367   5.082945     5.46   0.000     17.77305    37.70035
                   |
  pp_dummy#c.cogs2 |
                0  |  -1.969826   .2957168    -6.66   0.000    -2.549494   -1.390158
                1  |          0  (omitted)
                   |
  pp_dummy#c.cogs3 |
                0  |          0  (omitted)
                1  |  -.0310023   .0100291    -3.09   0.002    -.0506614   -.0113432
                   |
        year#nace2 |
          2005 42  |   .0349489   .0801911     0.44   0.663    -.1222427    .1921404
          2005 43  |  -.1930507   .0557451    -3.46   0.001    -.3023228   -.0837785
          2006 41  |  -.0286839   .0455243    -0.63   0.529    -.1179211    .0605534
          2006 42  |  -.0310252   .0719303    -0.43   0.666    -.1720239    .1099735
          2006 43  |  -.2344911   .0502343    -4.67   0.000     -.332961   -.1360212
          2007 41  |  -.0243213   .0442903    -0.55   0.583    -.1111398    .0624972
          2007 42  |  -.0294296    .072621    -0.41   0.685    -.1717821    .1129229
          2007 43  |  -.2802408   .0472582    -5.93   0.000    -.3728768   -.1876048
          2008 41  |  -.0827565   .0426904    -1.94   0.053    -.1664389    .0009258
          2008 42  |  -.0699951   .0676708    -1.03   0.301    -.2026443    .0626542
          2008 43  |  -.2644584   .0458607    -5.77   0.000    -.3543552   -.1745617
          2009 41  |  -.0696831   .0415478    -1.68   0.094    -.1511255    .0117594
          2009 42  |  -.1326668   .0663116    -2.00   0.045    -.2626517   -.0026819
          2009 43  |  -.2777503   .0444866    -6.24   0.000    -.3649535   -.1905471
          2010 41  |  -.0928498   .0407412    -2.28   0.023    -.1727113   -.0129883
          2010 42  |   -.161663   .0607819    -2.66   0.008    -.2808084   -.0425176
          2010 43  |  -.2905915   .0432313    -6.72   0.000    -.3753342   -.2058489
          2011 41  |  -.0718071   .0407852    -1.76   0.078    -.1517548    .0081407
          2011 42  |  -.1384748   .0614022    -2.26   0.024    -.2588361   -.0181135
          2011 43  |  -.2766819   .0436855    -6.33   0.000    -.3623148    -.191049
          2012 41  |  -.1150781   .0416353    -2.76   0.006    -.1966922   -.0334641
          2012 42  |  -.1682338   .0652743    -2.58   0.010    -.2961853   -.0402823
          2012 43  |   -.308265   .0450186    -6.85   0.000    -.3965111   -.2200189
          2013 41  |  -.1747151   .0468999    -3.73   0.000    -.2666489   -.0827813
          2013 42  |  -.2501837   .0989862    -2.53   0.012    -.4442178   -.0561496
          2013 43  |  -.2848315    .052713    -5.40   0.000    -.3881601   -.1815028
          2014 41  |  -.1276282   .0469934    -2.72   0.007    -.2197453    -.035511
          2014 42  |  -.2066703   .1014789    -2.04   0.042    -.4055905   -.0077501
          2014 43  |  -.3084316   .0512618    -6.02   0.000    -.4089156   -.2079476
          2015 41  |  -.0951685   .0430336    -2.21   0.027    -.1795235   -.0108134
          2015 42  |  -.0968999   .0794443    -1.22   0.223    -.2526277    .0588278
          2015 43  |  -.2608527   .0471943    -5.53   0.000    -.3533635   -.1683418
          2016 41  |  -.0817151   .0398961    -2.05   0.041    -.1599199   -.0035102
          2016 42  |  -.2233117   .0600811    -3.72   0.000    -.3410834   -.1055399
          2016 43  |  -.2652655   .0420181    -6.31   0.000    -.3476299   -.1829012
          2017 41  |  -.1021884   .0393916    -2.59   0.009    -.1794043   -.0249725
          2017 42  |  -.2361511   .0595808    -3.96   0.000    -.3529422     -.11936
          2017 43  |  -.2210006   .0412738    -5.35   0.000     -.301906   -.1400952
          2018 41  |  -.0641204   .0389935    -1.64   0.100     -.140556    .0123152
          2018 42  |   -.253638   .0596217    -4.25   0.000    -.3705091   -.1367669
          2018 43  |  -.2153514   .0408564    -5.27   0.000    -.2954385   -.1352642
          2019 41  |  -.0722868   .0388905    -1.86   0.063    -.1485205    .0039469
          2019 42  |  -.1877253   .0582087    -3.23   0.001    -.3018267   -.0736239
          2019 43  |  -.1994403   .0407008    -4.90   0.000    -.2792224   -.1196581
          2020 41  |  -.0828552    .039116    -2.12   0.034    -.1595308   -.0061796
          2020 42  |  -.1851394   .0587511    -3.15   0.002    -.3003041   -.0699747
          2020 43  |  -.2267473   .0406814    -5.57   0.000    -.3064914   -.1470031
          2021 41  |  -.1356776   .0407483    -3.33   0.001    -.2155529   -.0558024
          2021 42  |  -.1848647   .0665087    -2.78   0.005    -.3152359   -.0544936
          2021 43  |  -.2318414   .0428363    -5.41   0.000    -.3158096   -.1478733
                   |
             _cons |  -298.8112   49.58884    -6.03   0.000    -396.0158   -201.6065
------------------------------------------------------------------------------------

. predict phi
(option xb assumed; fitted values)

. predict epsilon, res

. *---COMPUTE CORRECTED SHARES----------------------------------------------------*
. gen y_c=go-epsilon

. gen Y_c=exp(y_c)

. gen alphahat=exp(cogs)/Y_c

. sum COGSS alphahat

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       COGSS |      9,620    .5037547    .1894311      .0664      .9653
    alphahat |      9,620    .4803568    .0737649   .1178826   1.029019

. bys pp_dummy: sum alphahat

--------------------------------------------------------------------------------------------------------------------------------------
-> pp_dummy = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    alphahat |      5,675    .5123919    .0723942   .1178826   1.029019

--------------------------------------------------------------------------------------------------------------------------------------
-> pp_dummy = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    alphahat |      3,945    .4342734    .0461515   .1768966   .7346584


. *------------------------------------------------------------------------------*
. xtset id year

Panel variable: id (unbalanced)
 Time variable: year, 2005 to 2021, but with gaps
         Delta: 1 unit

. gen Lphi=L.phi
(2,359 missing values generated)

. gen Lpp=L.pp_dummy
(2,359 missing values generated)

. gen kcogs=k*cogs

. gen Lk=L.k
(2,359 missing values generated)

. gen Lcogs = L.cogs
(2,359 missing values generated)

. gen Lk2=Lk^2
(2,359 missing values generated)

. gen Lcogs2=Lcogs^2
(2,359 missing values generated)

. gen LkLcogs=Lk*Lcogs
(2,359 missing values generated)

. gen kLcogs=k*Lcogs
(2,359 missing values generated)

. gen const = 1

. *------------------------------------------------------------------------------*
. drop if k == .
(0 observations deleted)

. drop if cogs == .
(0 observations deleted)

. drop if Lk == .
(2,359 observations deleted)

. drop if Lcogs == .
(0 observations deleted)

. drop if phi == .
(0 observations deleted)

. drop if Lphi == .
(0 observations deleted)

. drop if Lpp == .
(0 observations deleted)

. *------------- DYNAMIC PANEL FOR STARTING VALUES--------------------------------*
. xtabond2 go L.go L(0/1).(k cogs k2 cogs2 k1cogs1) i.year, ///
>          gmmstyle(L.(cogs cogs2) k k2 kLcogs) ivstyle(i.year, equation(level)) 
Favoring speed over space. To switch, type or click on mata: mata set matafavor space, perm.
2006b.year dropped due to collinearity
2020.year dropped due to collinearity
  DFm
  25

Dynamic panel-data estimation, one-step system GMM
------------------------------------------------------------------------------
Group variable: id                              Number of obs      =      5477
Time variable : year                            Number of groups   =      1090
Number of instruments = 655                     Obs per group: min =         1
Wald chi2(25) =  4.18e+07                                      avg =      5.02
Prob > chi2   =     0.000                                      max =        15
------------------------------------------------------------------------------
          go | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          go |
         L1. |   .5609372   .0312523    17.95   0.000     .4996838    .6221906
             |
           k |
         --. |  -.0049629   .1438221    -0.03   0.972    -.2868491    .2769233
         L1. |  -.2087847   .1424537    -1.47   0.143    -.4879888    .0704194
             |
        cogs |
         --. |   .5729717   .3511808     1.63   0.103    -.1153301    1.261273
         L1. |  -.1680351   .3027881    -0.55   0.579     -.761489    .4254187
             |
          k2 |
         --. |   .0049101   .0041195     1.19   0.233     -.003164    .0129841
         L1. |  -.0148699   .0040994    -3.63   0.000    -.0229045   -.0068352
             |
       cogs2 |
         --. |   .0093591   .0126503     0.74   0.459     -.015435    .0341531
         L1. |  -.0218198   .0111624    -1.95   0.051    -.0436977     .000058
             |
     k1cogs1 |
         --. |  -.0062862   .0134888    -0.47   0.641    -.0327238    .0201514
         L1. |   .0367588   .0130429     2.82   0.005     .0111951    .0623224
             |
        year |
       2007  |   .0271542   .0185741     1.46   0.144    -.0092503    .0635588
       2008  |  -.0011608   .0167975    -0.07   0.945    -.0340834    .0317618
       2009  |  -.0268165    .014882    -1.80   0.072    -.0559846    .0023517
       2010  |  -.0442306   .0139737    -3.17   0.002    -.0716186   -.0168427
       2011  |   .0197033   .0138285     1.42   0.154    -.0074001    .0468067
       2012  |  -.0383811   .0135637    -2.83   0.005    -.0649655   -.0117966
       2013  |  -.0126972   .0174089    -0.73   0.466     -.046818    .0214235
       2014  |   .0157317    .017179     0.92   0.360    -.0179385     .049402
       2015  |   .0416239    .017246     2.41   0.016     .0078223    .0754254
       2016  |  -.0222049   .0170353    -1.30   0.192    -.0555935    .0111837
       2017  |   .0220161   .0150358     1.46   0.143    -.0074536    .0514857
       2018  |   .0555709   .0126737     4.38   0.000     .0307308    .0804109
       2019  |   .0245027   .0117939     2.08   0.038      .001387    .0476184
       2021  |   .0025827   .0129541     0.20   0.842    -.0228069    .0279722
             |
       _cons |   2.169152   1.708953     1.27   0.204    -1.180335    5.518638
------------------------------------------------------------------------------
Instruments for first differences equation
  GMM-type (missing=0, separate instruments for each period unless collapsed)
    L(1/15).(L.cogs L.cogs2 k k2 kLcogs)
Instruments for levels equation
  Standard
    2006b.year 2007.year 2008.year 2009.year 2010.year 2011.year 2012.year
    2013.year 2014.year 2015.year 2016.year 2017.year 2018.year 2019.year
    2020.year 2021.year
    _cons
  GMM-type (missing=0, separate instruments for each period unless collapsed)
    D.(L.cogs L.cogs2 k k2 kLcogs)
------------------------------------------------------------------------------
Arellano-Bond test for AR(1) in first differences: z = -20.24  Pr > z =  0.000
Arellano-Bond test for AR(2) in first differences: z =   2.41  Pr > z =  0.016
------------------------------------------------------------------------------
Sargan test of overid. restrictions: chi2(629)  = 721.00  Prob > chi2 =  0.006
  (Not robust, but not weakened by many instruments.)

Difference-in-Sargan tests of exogeneity of instrument subsets:
  GMM instruments for levels
    Sargan test excluding group:     chi2(556)  = 500.91  Prob > chi2 =  0.954
    Difference (null H = exogenous): chi2(73)   = 220.09  Prob > chi2 =  0.000
  iv(2006b.year 2007.year 2008.year 2009.year 2010.year 2011.year 2012.year 2013.year 2014.year 2015.year 2016.year 2017.year 2018.yea
> r 2019.year 2020.year 2021.year, eq(level))
    Sargan test excluding group:     chi2(615)  = 697.84  Prob > chi2 =  0.011
    Difference (null H = exogenous): chi2(14)   =  23.16  Prob > chi2 =  0.058


. local cons_ols_tl = _b[_cons]

. local k_ols_tl = _b[k]

. local cogs_ols_tl = _b[cogs]

. local k2_ols_tl = _b[k2]

. local cogs2_ols_tl = _b[cogs2]

. local kcogs_ols_tl = _b[k1cogs1]

. gen betahat_dp = _b[cogs]+2*_b[cogs2]*cogs+_b[k1cogs1]*k

. 
. *-----------------------------BEGIN MATA PROGRAM-------------------------------*
. clear mata

. mata:
------------------------------------------------- mata (type end to exit) ------------------------------------------------------------
: 
: void GMM_DLW_TL(todo,betas,PHI,PHI_LAG,PP_lag,Z,X,X_lag,W,crit,g,H)
> {
>     PHI=st_data(.,("phi"))
>     PHI_LAG=st_data(.,("Lphi"))
>         PP_lag=st_data(.,("Lpp"))
>     Z=st_data(.,("const","k","Lcogs","k2","Lcogs2","kLcogs"))
>     X=st_data(.,("const","k","cogs","k2","cogs2","kcogs"))
>     X_lag=st_data(.,("const","Lk","Lcogs","Lk2","Lcogs2","LkLcogs"))
>         W = invsym(Z'Z)/rows(Z)
>     C=st_data(.,("const"))
> 
>         OMEGA=PHI-X*betas'
>         OMEGA_lag=PHI_LAG-X_lag*betas'
>         OMEGA_lag2 = OMEGA_lag:*OMEGA_lag
>         OMEGA_lag3 = OMEGA_lag2:*OMEGA_lag
>         OMEGA_lag_pol = (C,OMEGA_lag,OMEGA_lag2,OMEGA_lag3,PP_lag)
>         g_b = invsym(OMEGA_lag_pol'OMEGA_lag_pol)*OMEGA_lag_pol'OMEGA
>         XI=OMEGA-OMEGA_lag_pol*g_b
>         crit=(Z'XI)'*W*(Z'XI)
> }
note: argument todo unused.
note: argument g unused.
note: argument H unused.

: 
: 
: void DLW_TRANSLOG()
>     {
> S = optimize_init()
> optimize_init_argument(S, 1, PHI)
> optimize_init_argument(S, 2, PHI_LAG)
> optimize_init_argument(S, 3, PP_lag)
> optimize_init_argument(S, 4, Z)
> optimize_init_argument(S, 5, X)
> optimize_init_argument(S, 6, X_lag)
> optimize_init_argument(S, 7, W)
> optimize_init_params(S,(`cons_ols_tl',`k_ols_tl',`cogs_ols_tl', ///
>                                                 `k2_ols_tl',`cogs2_ols_tl',`kcogs_ols_tl'))
> optimize_init_evaluator(S, &GMM_DLW_TL())
> optimize_init_evaluatortype(S,"d0")                                             
> optimize_init_technique(S, "nm")
> optimize_init_nmsimplexdeltas(S, 1e-5)
> optimize_init_which(S,"min")
> p=optimize(S)
> optimize_init_params(S,p)
> p=optimize(S)
> optimize_init_params(S,p)
> p=optimize(S)
> p
> st_matrix("beta_dlwtranslog",p)
> }
note: variable PHI may be used before set.
note: variable PHI_LAG may be used before set.
note: variable PP_lag may be used before set.
note: variable Z may be used before set.
note: variable X may be used before set.
note: variable X_lag may be used before set.
note: variable W may be used before set.

: end
--------------------------------------------------------------------------------------------------------------------------------------

. *-------------------------------END MATA PROGRAM--------------------------------*
. cap program drop dlw_tl

. program dlw_tl, eclass
  1. preserve
  2. sort id year
  3. mata DLW_TRANSLOG()
  4. scalar const_tl = beta_dlwtranslog[1,1]
  5. scalar k_tl = beta_dlwtranslog[1,2]
  6. scalar cogs_tl = beta_dlwtranslog[1,3]
  7. scalar k2_tl = beta_dlwtranslog[1,4]
  8. scalar cogs2_tl = beta_dlwtranslog[1,5]
  9. scalar kcogs_tl = beta_dlwtranslog[1,6]
 10. matrix beta_dlwtranslog=beta_dlwtranslog
 11. mat colnames beta_dlwtranslog = const k cogs k2 cogs2 kcogs
 12. ereturn post beta_dlwtranslog
 13. restore
 14. end

. *-------------------------------------------------------------------------------*/
. tsset, clear

. bootstrap, cluster(id) idcluster(year) reps(2): dlw_tl
(running dlw_tl on estimation sample)

warning: dlw_tl does not set e(sample), so no observations will be excluded from the resampling because of missing values or other
         reasons. To exclude observations, press Break, save the data, drop any observations that are to be excluded, and rerun
         bootstrap.

Bootstrap replications (2): .. done

Bootstrap results                                        Number of obs = 7,261
                                                         Replications  =     2

                                  (Replications based on 1,297 clusters in id)
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             | coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       const |   2.170243   .0004633  4684.54   0.000     2.169335    2.171151
           k |  -.0048851   .0012153    -4.02   0.000    -.0072671   -.0025031
        cogs |   .5730081   .0004908  1167.40   0.000      .572046    .5739701
          k2 |   .0063543   1.80e-06  3527.31   0.000     .0063507    .0063578
       cogs2 |   .0065875   .0000267   247.08   0.000     .0065353    .0066398
       kcogs |  -.0063201   .0000164  -386.54   0.000    -.0063522   -.0062881
------------------------------------------------------------------------------

. estat bootstrap

Bootstrap results                               Number of obs     =      7,261
                                                Replications      =          2

                                  (Replications based on 1,297 clusters in id)
------------------------------------------------------------------------------
             |    Observed               Bootstrap
             | coefficient       Bias    std. err.  [95% conf. interval]
-------------+----------------------------------------------------------------
       const |   2.1702432  -.0005309   .00046328           .          .  (BC)
           k |  -.00488513   .0002706   .00121533   -.0054739  -.0037551  (BC)
        cogs |   .57300806   .0009888   .00049084           .          .  (BC)
          k2 |   .00635426  -.0002053   1.801e-06           .          .  (BC)
       cogs2 |   .00658753  -.0002217   .00002666           .          .  (BC)
       kcogs |  -.00632012   1.78e-06   .00001635   -.0063299  -.0063068  (BC)
------------------------------------------------------------------------------
Key: BC: Bias-corrected

. matrix beta_dlwtranslog = e(b)

. gen k_tl = beta_dlwtranslog[1,2]

. gen cogs_tl = beta_dlwtranslog[1,3]

. gen k2_tl = beta_dlwtranslog[1,4]

. gen cogs2_tl = beta_dlwtranslog[1,5]

. gen kcogs_tl = beta_dlwtranslog[1,6]

. gen omegahat_tl = phi-k_tl*k-cogs_tl*cogs-k2_tl*k2-cogs2_tl*cogs2-kcogs_tl*k1cogs1

. gen betahat_dlw = cogs_tl+2*cogs2_tl*cogs+kcogs_tl*k

. gen muhat_dlw = betahat_dlw/alphahat

. *-------------------------------------------------------------------------------*
. sum betahat*

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  betahat_dp |      7,261    .7994252    .0167276   .7372392   .8669844
 betahat_dlw |      7,261    .7018999    .0112558   .6626435   .7427834

. bys pp_dummy: sum muhat*

--------------------------------------------------------------------------------------------------------------------------------------
-> pp_dummy = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   muhat_dlw |      4,034    1.380222    .1862844   .7964074   3.302052

--------------------------------------------------------------------------------------------------------------------------------------
-> pp_dummy = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   muhat_dlw |      3,227    1.636748    .1692929   1.195057   3.745938


. log close
      name:  <unnamed>
       log:  C:\Users\chadi\OneDrive - Handelshögskolan i Stockholm\MarkupsAndPublicProcurement\Markups-and-Public-Procurement\PublicP
> rocurement\DLW.log
  log type:  text
 closed on:   9 Sep 2024, 01:22:14
--------------------------------------------------------------------------------------------------------------------------------------
